#+title: Waydroid on X11 on Nixos
#+Date: 2025-02-03
#+Draft: false
#+Tags[]: nixos android waydroid
#+PROPERTY: header-args :eval never-export

Waydroid is an /Android in a Container/ solution for Linux. Waydroid uses Linux
namespaces (user, pid, uts, net, mount, ipc) to run a full Android system in a
container and provide Android applications on any GNU/Linux-based platform (arm,
arm64, x86, x86-64). The Android system inside the container has direct access
to needed hardware through LXC and the binder interface.

But unfortunately is only available for =Wayland=, and due to reasons [fn:1] I use
=X11=.

** Managing applications throught the command line

Listing installed applications:

#+begin_src bash :results verbatim :async
waydroid app list
#+end_src

#+RESULTS:
#+begin_example
Name: Files
packageName: com.android.documentsui
categories:
	android.intent.category.LAUNCHER
Name: Google Play Store
packageName: com.android.vending
categories:
	android.intent.category.LAUNCHER
Name: Contacts
packageName: com.android.contacts
categories:
	android.intent.category.LAUNCHER
Name: Recorder
packageName: org.lineageos.recorder
categories:
	android.intent.category.LAUNCHER
Name: Gallery
packageName: com.android.gallery3d
categories:
	android.intent.category.LAUNCHER
Name: Browser
packageName: org.lineageos.jelly
categories:
	android.intent.category.LAUNCHER
Name: Music
packageName: org.lineageos.eleven
categories:
	android.intent.category.LAUNCHER
Name: Calendar
packageName: org.lineageos.etar
categories:
	android.intent.category.LAUNCHER
Name: Settings
packageName: com.android.settings
categories:
	android.intent.category.LAUNCHER
Name: Calculator
packageName: com.android.calculator2
categories:
	android.intent.category.LAUNCHER
Name: Clock
packageName: com.android.deskclock
categories:
	android.intent.category.LAUNCHER
Name: System Tracing
packageName: com.android.traceur
categories:
	android.intent.category.INFO
#+end_example

Installing an application from an =.apk= file (note the section above when I
mention mapping directories):

#+begin_src bash :results verbatim :async
waydroid app install </path/to/app.apk>
#+end_src

Launching an application:
#+begin_src bash :results verbatim :async
waydroid app launch <application package name>
#+end_src

As for example:

#+begin_src bash :results verbatim :async
waydroid app launch com.android.calculator2
#+end_src


